tutorials/incompressible/simpleFoam/turbineSiting/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $turbulentKE;
        value           $internalField;
    }

    inlet
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions"
    }

    terrain
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }

    ground
    {
        type            zeroGradient;
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
